// engien은 c++ assembly
// v8 구글 크롬, 오페라 엣지, Whale 등 자바스크립트 엔진 중 가장 많이 쓰이는 엔진으로서 호준 강사님 의견에 가장 탄탄한 엔진이라고 생각함

// v8은 속도 위주의 코드이고, 챠크라는 안전성 위주의 코드임
// 각자 추구하는 것이 다른 것이죠.
// v8 엔진 업데이트 되면 웨일 난리남 따라가느냐고
// 독자적인 것을 만들 것이라고 했었음
// v8 엔진 보아 ㄴ취약점 발견! 

// 업데이트가 ㅐ매우 빠르므로 22년 이전의 책은 구매하지 않는 것을 추천드립니다.

// 바벨과 같은 트랜스파일러 사용해 코드변환 -> 다운그레이드라고 생각해주시면 됩니다. 

// 폴리필 - 내가 작성한 코드를 구버ㅓㄴ에서 사용할 수있도록 채워주는 것 

// npm = 패키지 관리 툴 .=` 패키지 관리 툴
// react 다운로드 받으실 수 있어요?
// 게임개발을 위한 것도 있고 getDate 같은 아주 단순한 함수ㅂ터 리액트처럼 무거운것까지

// npmm은 페이수북처럼 거대 IT기업이 관리해주지 않기 때문에 커뮤니티 안에서 해결해야함
// 그에 반해 yarn은 메타에서 관리해줘서 안정성 면에서 뛰어난 패키지 관리 툴(앱스토어 같은 )입니다. 

// 프레임워크와 라이브러리
// 경계 모호 무조건 이렇다 라는 전제를 하시고 접근하시지 않기를 바랍ㄴ다. 

// 프레임 워크 - 설명서가 있고 그 설명서 대로 코딩을 하셔야 합니다 내 코드가 그 안에 내 코드가 부품처럼 들어가는 것 종합선물세트입니다 이미 다 구현이 되어있어ㅛ 설명서대로 한 스텝 한 스텝 나가시면 됨니다. 유행을 따기 때문에 프레임워크를 배우는 것에 너무 집중하지 마라
// 라이브러리 - 내 코드의 부품이 되는 것이 라이브러리  

window.alert("dkssudgkdy")  